### Assignment 3 (29th August 2022, Monday)

#### Initializing Connection

In [2]:
import mysql.connector as sqltor

connection = sqltor.connect(host="localhost", user="root", password="mysqlpasswd")
cursor = connection.cursor()
cursor.execute("CREATE DATABASE IF NOT EXISTS week3i")
cursor.execute("USE week3i")

#### Adding Helper functions

In [3]:
def disp():
    print(*[line for line in cursor], sep="\n")


def run(query: str):
    cursor.execute(query)

#### Testing Tables and Datasets

In [ ]:
run("SHOW DATABASES")
disp()
run("SHOW TABLES")
disp()
# exit()

| Database           |
| ------------------ |
| information_schema |
| mysql              |
| performance_schema |
| sys                |
| week1              |
| week2              |
| week3              |

#### Queries

##### Consider the following employee table and execute the queries based on it

In [7]:
run(
    """CREATE TABLE Employee (
				Emp_id INT(3) AUTO_INCREMENT PRIMARY KEY,
				F_Name VARCHAR(10),
				L_Name VARCHAR(10),
				Job_Type VARCHAR(10),
				Salary INT(6),
				Comission INT(5),
				Dept VARCHAR(15),
				Manager_id INT(2),
				DOJ DATE
			)
"""
)

| Field      | Type        | Null | Key | Default | Extra          |
| ---------- | ----------- | ---- | --- | ------- | -------------- |
| Emp_id     | int         | NO   | PRI | NULL    | auto_increment |
| F_Name     | varchar(10) | YES  |     | NULL    |                |
| L_Name     | varchar(10) | YES  |     | NULL    |                |
| Job_Type   | varchar(10) | YES  |     | NULL    |                |
| Salary     | int         | YES  |     | NULL    |                |
| Comission  | int         | YES  |     | NULL    |                |
| Dept       | varchar(15) | YES  |     | NULL    |                |
| Manager_id | int         | YES  |     | NULL    |                |
| DOJ        | date        | YES  |     | NULL    |                |

Inserting the values

In [13]:
run(
    """INSERT INTO Employee VALUES
            (NULL, 'Arun', 'Khan', 'Manager', 90000, NULL, 'Production', NULL, '1998-01-04'),
            (NULL, 'Barun', 'Kumar', 'Manager', 80000, NULL, 'Marketing', NULL, '1998-02-09'),
            (NULL, 'Chitra', 'Kapoor', 'Engineer', 60000, NULL, 'Production', 1, '1998-01-08'),
            (NULL, 'Dheeraj', 'Mitra', 'Accountant', 75000, NULL, 'Sales', 4, '2001-12-27'),
            (NULL, 'Emma', 'Dutt', 'Engineer', 55000, NULL, 'Production', 1, '2002-03-20'),
            (NULL, 'Floki', 'Dutt', 'Accountant', 70000, NULL, 'Accounts', NULL, '2000-07-16')
            
"""
)
connection.commit()

| Emp_id | F_Name  | L_Name | Job_Type   | Salary | Comission | Dept       | Manager_id | DOJ        |
| -----: | ------- | ------ | ---------- | -----: | --------: | ---------- | ---------: | ---------- |
|      1 | Arun    | Khan   | Manager    |  90000 |      NULL | Production |       NULL | 1998-01-04 |
|      2 | Barun   | Kumar  | Manager    |  80000 |      NULL | Marketing  |       NULL | 1998-02-09 |
|      3 | Chitra  | Kapoor | Engineer   |  60000 |      NULL | Production |          1 | 1998-01-08 |
|      4 | Dheeraj | Mitra  | Accountant |  75000 |      NULL | Sales      |          4 | 2001-12-27 |
|      5 | Emma    | Dutt   | Engineer   |  55000 |      NULL | Production |          1 | 2002-03-20 |
|      6 | Floki   | Dutt   | Accountant |  70000 |      NULL | Accounts   |       NULL | 2000-07-16 |

##### 1. Show f_name, l_name and Job_type from employees.

In [ ]:
run("SELECT f_name, l_name, Job_type FROM Employee")
disp()

| f_name  | l_name | Job_type   |
| ------- | ------ | ---------- |
| Arun    | Khan   | Manager    |
| Barun   | Kumar  | Manager    |
| Chitra  | Kapoor | Engineer   |
| Dheeraj | Mitra  | Accountant |
| Emma    | Dutt   | Engineer   |
| Floki   | Dutt   | Accountant |

##### 2. Show employee details in the following fashion:

    Employee details
    Arun is a manager

In [11]:
run("SELECT CONCAT(f_name, ' is a ', Job_type) AS 'Employee Details' FROM Employee")

| Employee Details        |
| ----------------------- |
| Arun is a Manager       |
| Barun is a Manager      |
| Chitra is a Engineer    |
| Dheeraj is a Accountant |
| Emma is a Engineer      |
| Floki is a Accountant   |

##### 3. Show the monthly salary details in the following fashion:

    Monthly Salary Details
    Arun's monthly salary is Rs.90000

In [ ]:
run(
    """SELECT CONCAT(f_name, '\\'s monthly salary is Rs.', salary) 
        AS 'Monthly Salary Details' FROM Employee
"""
)

disp()

| Monthly Salary Details               |
| ------------------------------------ |
| Arun's monthly salary is Rs.90000    |
| Barun's monthly salary is Rs.80000   |
| Chitra's monthly salary is Rs.60000  |
| Dheeraj's monthly salary is Rs.75000 |
| Emma's monthly salary is Rs.55000    |
| Floki's monthly salary is Rs.70000   |

##### Consider the Department table to answer the queries

In [20]:
run(
    """CREATE TABLE Department (
				d_name VARCHAR(15),
				d_loc VARCHAR(15),
				HOD_id INT(2)
			)
"""
)

| Field  | Type        | Null | Key | Default | Extra |
| ------ | ----------- | ---- | --- | ------- | ----- |
| d_name | varchar(15) | YES  |     | NULL    |       |
| d_loc  | varchar(15) | YES  |     | NULL    |       |
| HOD_id | int         | YES  |     | NULL    |       |

Inserting values

In [21]:
run(
    """INSERT INTO Department VALUES
            ('Sales', 'Kol', 4),
            ('Accounts', 'Delhi', 6),
            ('Production', 'Kol', 1),
            ('Marketing', 'Kol', 2),
            ('R & D', 'Marketing', 8)
"""
)
connection.commit()

| d_name     | d_loc     | HOD_id |
| ---------- | --------- | -----: |
| Sales      | Kol       |      4 |
| Accounts   | Delhi     |      6 |
| Production | Kol       |      1 |
| Marketing  | Kol       |      2 |
| R & D      | Marketing |      8 |

##### 4. Show the different department names from the department table

In [22]:
run("SELECT DISTINCT d_name as 'Department Names' FROM Department")

| Department Names |
| ---------------- |
| Sales            |
| Accounts         |
| Production       |
| Marketing        |
| R & D            |

##### 5. Show the employee names who works in 'Sales'

In [ ]:
run(
    """
    SELECT CONCAT(f_name,' ' , l_name) AS 'Sales Employees'
    FROM Employee WHERE Dept='Sales'
"""
)
disp()

| Sales Employees |
| --------------- |
| Dheeraj Mitra   |

##### 6. Show the employee names who get salary more than 50000 per month

In [ ]:
run(
    """
    SELECT CONCAT(f_name,' ' , l_name) AS 'Employees' FROM Employee  
    WHERE Salary > 50000
"""
)
disp()

| Employees     |
| ------------- |
| Arun Khan     |
| Barun Kumar   |
| Chitra Kapoor |
| Dheeraj Mitra |
| Emma Dutt     |
| Floki Dutt    |

##### 7. Show the details of the employees whose manager id is not 1

In [ ]:
run(
    """
    SELECT * FROM Employee 
    WHERE Manager_id <> 1 OR Manager_id IS NULL
"""
)
disp()

| Emp_id | F_Name  | L_Name | Job_Type   | Salary | Comission | Dept       | Manager_id | DOJ        |
| ------ | ------- | ------ | ---------- | ------ | --------- | ---------- | ---------- | ---------- |
| 1      | Arun    | Khan   | Manager    | 90000  | NULL      | Production | NULL       | 1998-01-04 |
| 2      | Barun   | Kumar  | Manager    | 80000  | NULL      | Marketing  | NULL       | 1998-02-09 |
| 4      | Dheeraj | Mitra  | Accountant | 75000  | NULL      | Sales      | 4          | 2001-12-27 |
| 6      | Floki   | Dutt   | Accountant | 70000  | NULL      | Accounts   | NULL       | 2000-07-16 |

| bname |
| ----- |

##### 8. Show the employee details whose salary ranges between 40000 and 70000.

In [42]:
run(
    """
    SELECT * FROM Employee 
    WHERE Salary BETWEEN 40000 AND 70000
"""
)
disp()

| Emp_id | F_Name | L_Name | Job_Type   | Salary | Comission | Dept       | Manager_id | DOJ        |
| ------ | ------ | ------ | ---------- | ------ | --------- | ---------- | ---------- | ---------- |
| 3      | Chitra | Kapoor | Engineer   | 60000  | NULL      | Production | 1          | 1998-01-08 |
| 5      | Emma   | Dutt   | Engineer   | 55000  | NULL      | Production | 1          | 2002-03-20 |
| 6      | Floki  | Dutt   | Accountant | 70000  | NULL      | Accounts   | NULL       | 2000-07-16 |

##### 9. Show the details of the employees who work under the manager having id 1, 6 and 8

In [ ]:
run(
    """
    SELECT * FROM Employee 
    WHERE Manager_Id IN (1, 6, 8)
"""
)
disp()

| Emp_id | F_Name | L_Name | Job_Type | Salary | Comission | Dept       | Manager_id | DOJ        |
| ------ | ------ | ------ | -------- | ------ | --------- | ---------- | ---------- | ---------- |
| 3      | Chitra | Kapoor | Engineer | 60000  | NULL      | Production | 1          | 1998-01-08 |
| 5      | Emma   | Dutt   | Engineer | 55000  | NULL      | Production | 1          | 2002-03-20 |

##### 10. Select the f_name and salary of those employees whose last name starts with 'K'

In [ ]:
run(
    """
    SELECT f_name, salary FROM Employee 
    WHERE l_name LIKE "K%"
"""
)
disp()

| f_name | salary |
| ------ | ------ |
| Arun   | 90000  |
| Barun  | 80000  |
| Chitra | 60000  |

##### 11. Select the f_name and salary of those employees whose last name starts with 'K' and ends with 'R'

In [ ]:
run(
    """
    SELECT f_name, salary FROM Employee 
    WHERE l_name LIKE "K%R"
"""
)
disp()

| f_name | salary |
| ------ | ------ |
| Barun  | 80000  |
| Chitra | 60000  |

##### 12. Show the details of those employees where 3rd letter of l_name is 'o'

In [ ]:
run("select * FROM EMPLOYEE WHERE l_name LIKE '__o%'")
disp()

Empty set (0.00 sec)

##### 13. Select the details of those employees who works as an engineer with monthly salary more than 50000

In [ ]:
run(
    """
    SELECT * FROM Employee 
    WHERE Dept = 'Engineer' AND Salary > 50000
"""
)
disp()

Empty set (0.00 sec)

##### 14. Select the employees whose department is ‘Production’ or monthly salary is more than 60000 per month

In [ ]:
run(
    """
    SELECT * FROM Employee 
    WHERE Dept = 'Production' OR Salary > 60000
"""
)
disp()

| Emp_id | F_Name  | L_Name | Job_Type   | Salary | Comission | Dept       | Manager_id | DOJ        |
| ------ | ------- | ------ | ---------- | ------ | --------- | ---------- | ---------- | ---------- |
| 1      | Arun    | Khan   | Manager    | 90000  | NULL      | Production | NULL       | 1998-01-04 |
| 2      | Barun   | Kumar  | Manager    | 80000  | NULL      | Marketing  | NULL       | 1998-02-09 |
| 3      | Chitra  | Kapoor | Engineer   | 60000  | NULL      | Production | 1          | 1998-01-08 |
| 4      | Dheeraj | Mitra  | Accountant | 75000  | NULL      | Sales      | 4          | 2001-12-27 |
| 5      | Emma    | Dutt   | Engineer   | 55000  | NULL      | Production | 1          | 2002-03-20 |
| 6      | Floki   | Dutt   | Accountant | 70000  | NULL      | Accounts   | NULL       | 2000-07-16 |

##### 15. Find the minimum salary, maximum salary, total salary, average salary of the employees who work in ‘Sales’ department

In [ ]:
run(
    """
    SELECT MIN(Salary) AS 'MINIMUM SALARY', 
           MAX(Salary) AS 'MAXIMUM SALARY', 
           SUM(Salary) AS 'TOTAL SALARY', 
           AVG(Salary) AS 'AVERAGE SALARY'
    FROM Employee WHERE Dept = 'Sales'
"""
)
disp()

| MINIMUM SALARY | MAXIMUM SALARY | TOTAL SALARY | AVERAGE SALARY |
| -------------- | -------------- | ------------ | -------------- |
| 75000          | 75000          | 75000        | 75000.0000     |

##### 16. Find the employee l_name that is first and f_name that is last if they are arranged in an order

In [ ]:
run(
    """
    SELECT l_name AS 'FIRST L_Name', 
           f_name AS 'LAST F_Name'
    FROM (
        (SELECT l_name FROM Employee ORDER BY l_name LIMIT 1) AS _,
        (SELECT f_name FROM Employee ORDER BY f_name DESC LIMIT 1) AS __
    )
"""
)
disp()

| FIRST L_Name | LAST F_Name |
| ------------ | ----------- |
| Dutt         | Floki       |

##### 17. Find the number of employees working in each department

In [ ]:
run("SELECT Dept, COUNT(*) AS Employees FROM Employee GROUP BY dept")
disp()

| Dept       | Employees |
| ---------- | --------: |
| Production |         3 |
| Marketing  |         1 |
| Sales      |         1 |
| Accounts   |         1 |

##### 18. Find the number of departments from employee table

In [ ]:
run("SELECT COUNT(DISTINCT Dept) AS Employees FROM Employee")
disp()

| Employees |
| --------: |
|         4 |

##### 19. Find the Average Commission of the employees.

In [ ]:
run("SELECT AVG(Comission) AS 'Average Commission' FROM Employee")
disp()

| Average Commission |
| -----------------: |
|               NULL |

##### 20. FInd the average salaries of the employees department wise

In [ ]:
run(
    """
    SELECT Dept, AVG(Salary) AS 'Average Salary' FROM Employee
    GROUP BY Dept
"""
)
disp()

| Dept       | Average Salary |
| ---------- | -------------- |
| Production | 68333.3333     |
| Marketing  | 80000.0000     |
| Sales      | 75000.0000     |
| Accounts   | 70000.0000     |

##### 21. Find the sum of salary of different job_type according to different departments

In [ ]:
run(
    """
    SELECT Dept, Job_Type, 
           SUM(Salary) AS 'Aggregate Salary' 
    FROM Employee GROUP BY Dept, Job_Type
    ORDER BY Dept

"""
)
disp()

| Dept       | Job_Type   | Aggregate Salary |
| ---------- | ---------- | ---------------- |
| Accounts   | Accountant | 70000            |
| Marketing  | Manager    | 80000            |
| Production | Engineer   | 115000           |
| Production | Manager    | 90000            |
| Sales      | Accountant | 75000            |

##### 22. Find the department name and average salaries of those departments whose average salary is greater than 40000

In [ ]:
"""
    SELECT * FROM 
        (SELECT Dept AS 'Department', 
        AVG(Salary) AS 'Average Salary' 
        FROM Employee GROUP BY Dept) AS _
    WHERE `Average Salary` > 40000
"""
run(
    """
    SELECT Dept AS 'Department', 
        AVG(Salary) AS `Average Salary` 
    FROM Employee GROUP BY Dept
    HAVING `Average Salary` > 40000
"""
)
disp()

| Department | Average Salary |
| ---------- | -------------: |
| Production |     68333.3333 |
| Marketing  |     80000.0000 |
| Sales      |     75000.0000 |
| Accounts   |     70000.0000 |

##### 23. Find the department name and maximum salaries of those departments whose maximum salary is greater than 55000

In [ ]:
run(
    """
    SELECT Dept AS 'Department', 
        MAX(Salary) AS `Maximum Salary` 
    FROM Employee GROUP BY Dept
    HAVING `Maximum Salary` > 40000
"""
)
disp()

| Department | Maximum Salary |
| ---------- | -------------: |
| Production |          90000 |
| Marketing  |          80000 |
| Sales      |          75000 |
| Accounts   |          70000 |

##### 24. Display the job_type and total monthly salary for each job_type where total payroll is exceeding 100000

In [ ]:
run(
    """
    SELECT Job_Type AS 'Job Type', 
        SUM(Salary) AS 'Total Monthly Salary'
    FROM Employee GROUP BY Job_Type
    HAVING SUM(Salary) > 100000
"""
)
disp()

| Job Type   | Total Monthly Salary |
| ---------- | -------------------: |
| Manager    |               170000 |
| Engineer   |               115000 |
| Accountant |               145000 |

##### 25. Display the name of the department having maximum average salary

In [ ]:
"""
SELECT Dept, AVG(Salary) FROM Employee 
GROUP BY Dept 
ORDER BY AVG(Salary) DESC LIMIT 1
"""
run(
    """
    SELECT Dept, AVG(Salary) AS 'Average Salary'
    FROM Employee GROUP BY Dept 
    ORDER BY AVG(Salary) DESC LIMIT 1
"""
)
disp()

| Dept      | Average Salary |
| --------- | -------------: |
| Marketing |     80000.0000 |